{
	"dataset": {
		"id": "qald-7-train-multilingual"
	},
	"questions": [{
			"id": "196",
			"answertype": "resource",
			"aggregation": true,
			"onlydbo": false,
			"hybrid": false,
			"question": [{
					"language": "en",
					"string": "Give me all cities in New Jersey with more than 100000 inhabitants.",
					"keywords": "New Jersey, city, inhabitants, more than 100000"
				},
				{
					"language": "pt_BR",
					"string": "Liste todas as cidades em New Jersey com mais de 100000 habitantes.",
					"keywords": "cidade, New Jersey, mais de 100000, habitantes"
				},
				{
					"language": "de",
					"string": "Gib mir alle Städte in New Jersey, die mehr als 100000 Einwohner haben.",
					"keywords": "New Jersey, Stadt, Einwohner, mehr als 100000"
				},
				{
					"language": "es",
					"string": "Dame todas las cuidades en New Jersey que tengan más de 100000 habitantes.",
					"keywords": "New Jersey, ciudad, habitantes, más de 100000"
				},
				{
					"language": "it",
					"string": "Dammi tutte le città del New Jersey con più di 100000 abitanti.",
					"keywords": "New Jersey, città, abitanti, più di 100000"
				},
				{
					"language": "fr",
					"string": "Donnes-moi toutes les villes du New Jersey avec plus de 100000 habitants.",
					"keywords": "New Jersey, villes, habitants, plus de 100000"
				},
				{
					"language": "nl",
					"string": "Geef alle steden in New Jersey met meer dan 100000 inwoners.",
					"keywords": "New Jersey, stad, inwoners, meer dan 100000"
				},
				{
					"language": "hi_IN",
					"string": "मुझे न्यू जर्सी के १००००० से अधिक निवासियों के साथ सभी शहरों की सूचि बतायें।",
					"keywords": "न्यू जर्सी, १००००० से अधिक निवासि, शहर"
				}
			],
			"query": {
				"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX dbp: <http://dbpedia.org/property/>\nPREFIX res: <http://dbpedia.org/resource/>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nSELECT DISTINCT ?uri \nWHERE {\n\t?uri rdf:type dbo:City .\n        ?uri dbo:isPartOf res:New_Jersey .\n        ?uri dbp:populationTotal ?inhabitants .\n        FILTER (?inhabitants > 100000) .\n}"
			},
			"answers": [{
				"head": {
					"vars": [
						"uri"
					]
				},
				"results": {
					"bindings": [{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Newark,_New_Jersey"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Jersey_City,_New_Jersey"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Elizabeth,_New_Jersey"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Paterson,_New_Jersey"
							}
						}
					]
				}
			}]
		},
		{
			"id": "204",
			"answertype": "resource",
			"aggregation": false,
			"onlydbo": true,
			"hybrid": false,
			"question": [{
					"language": "en",
					"string": "Give me all members of Prodigy.",
					"keywords": "member, Prodigy"
				},
				{
					"language": "pt_BR",
					"string": "Liste todos os membros da Prodigy",
					"keywords": "membros, Prodigy"
				},
				{
					"language": "fa",
					"string": "تمام اعضای پرادیجی را لیست کن.",
					"keywords": "اعضا، پرادیجی"
				},
				{
					"language": "de",
					"string": "Gib mir alle Bandmitglieder von Prodigy.",
					"keywords": "Bandmitglied, Prodigy"
				},
				{
					"language": "es",
					"string": "Dame todos los miembros de la banda Prodigy.",
					"keywords": "miembros de la banda Prodigy"
				},
				{
					"language": "it",
					"string": "Dammi tutti i membri dei Prodigy.",
					"keywords": "membri, Prodigy"
				},
				{
					"language": "fr",
					"string": "Donne-moi tous les membres de Prodigy.",
					"keywords": "members, Prodigy"
				},
				{
					"language": "nl",
					"string": "Noem alle leden van Prodigy.",
					"keywords": "leden, Prodigy"
				},
				{
					"language": "hi_IN",
					"string": "मुझे प्रोडिजी के सभी सदस्यों की सूचि बतायें।",
					"keywords": "प्रोडिजी, सदस्यों"
				},
				{
					"language": "ro",
					"string": "Dă-mi toții membrii Prodigy.",
					"keywords": "membru, Prodigy"
				}
			],
			"query": {
				"sparql": "SELECT DISTINCT ?uri WHERE {  <http://dbpedia.org/resource/The_Prodigy> <http://dbpedia.org/ontology/bandMember> ?uri . } "
			},
			"answers": [{
				"head": {
					"vars": [
						"uri"
					]
				},
				"results": {
					"bindings": [{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Maxim_(musician)"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Liam_Howlett"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Keith_Flint"
							}
						}
					]
				}
			}]
		}
	]
}
