{
	"dataset": {
		"id": "qald-7-train-multilingual"
	},
	"questions": [{
			"id": "1",
			"answertype": "resource",
			"aggregation": false,
			"onlydbo": true,
			"hybrid": false,
			"question": [{
					"language": "en",
					"string": "List all the musicals with music by Elton John.",
					"keywords": "musicals, music by, Elton John"
				},
				{
					"language": "pt_BR",
					"string": "Liste todos os musicais com músicas de Elton John.",
					"keywords": "musicais, música de, Elton John"
				},
				{
					"language": "de",
					"string": "Liste alle Musicals mit Musik von Elton John auf.",
					"keywords": "Musicals, Musik von, Elton John"
				},
				{
					"language": "es",
					"string": "Dame todos los musicales con música de Elton John.",
					"keywords": "musicales, música, Elton John"
				},
				{
					"language": "it",
					"string": "Elenca tutti i musicals con musiche di Elton John.",
					"keywords": "musicals, musiche, Elton John"
				},
				{
					"language": "fr",
					"string": "Donne-moi tous les musicals avec de la musique de de Elton John.",
					"keywords": "musicals, musique, Elton John"
				},
				{
					"language": "nl",
					"string": "Toen een lijst van alle musicals met muziek van Elton John.",
					"keywords": "musicals, muziek van, Elton John"
				},
				{
					"language": "hi_IN",
					"string": "एल्टन जॉन द्वारा संगीत के साथ सभी संगीतों को सूचीबद्ध करें।",
					"keywords": "एल्टन जॉन का संगीत"
				},
				{
					"language": "ro",
					"string": "Listează toate muzicalurile cu muzică de Elton John.",
					"keywords": "muzicaluri, muzică de Elton John"
				}
			],
			"query": {
				"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> \nSELECT DISTINCT ?uri\nWHERE { \n        ?uri rdf:type dbo:Musical .\n        ?uri dbo:musicBy res:Elton_John .\n}"
			},
			"answers": [{
				"head": {
					"vars": [
						"uri"
					]
				},
				"results": {
					"bindings": [{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/The_Lion_King_(musical)"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Lestat_(musical)"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Billy_Elliot_the_Musical"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Aida_(musical)"
							}
						}
					]
				}
			}]
		},
		{
			"id": "51",
			"answertype": "resource",
			"aggregation": false,
			"onlydbo": true,
			"hybrid": false,
			"question": [{
					"language": "en",
					"string": "Give me all actors starring in movies directed by William Shatner.",
					"keywords": "actor, starring, movie, direct, William Shatner"
				},
				{
					"language": "pt_BR",
					"string": "Liste todos os atores que estrelaram em filmes dirigidos por William Shatner.",
					"keywords": "atores, files, diretor, William Shatner"
				},
				{
					"language": "fa",
					"string": "تمام بازیگرانی که در فیلم های کارگردانی شده توسط ویلیام شاتنر بازی کرده اند را لیست کن.",
					"keywords": "بازیگرانی، فیلم های، کارگردانی شده، ویلیام شاتنر، بازی کرده اند"
				},
				{
					"language": "de",
					"string": "Gib mir alle Schauspieler von Filmen, in denen William Shatner Regie geführt hat.",
					"keywords": "Schauspieler, Film, Regie, William Shatner"
				},
				{
					"language": "es",
					"string": "Dame todos los actores de películas dirigidas por William Shatner.",
					"keywords": "actor, película, director, William Shatner"
				},
				{
					"language": "it",
					"string": "Dammi tutti gli attori che recitano in film diretti da William Shatner.",
					"keywords": "attore, recitare, film, diretto, William Shatner"
				},
				{
					"language": "fr",
					"string": "Donnes-moi tous les acteurs qui ont joué dans des films réalisés par Williams Shatner.",
					"keywords": "acteur, film, réalisé, William Shatner"
				},
				{
					"language": "nl",
					"string": "Geef alle acteurs van films waar William Shatner de regie van voerde.",
					"keywords": "acteur, film, regisseur, William Shatner"
				},
				{
					"language": "hi_IN",
					"string": "विलियम शेटनेर द्वारा निर्देशित फिल्मों में सभी कलाकारों की सूचि दे।",
					"keywords": "विलियम शेटनेर, निर्देशित फिल्म, कलाकार"
				},
				{
					"language": "ro",
					"string": "Dă-mi toți actorii care joacă roluri principale în filme regizate de William Shatner.",
					"keywords": "actor, rol principal, film, regiza, William Shatner"
				}
			],
			"query": {
				"sparql": "SELECT DISTINCT ?uri WHERE {  ?x <http://dbpedia.org/ontology/director> <http://dbpedia.org/resource/William_Shatner> .  ?x <http://dbpedia.org/ontology/starring> ?uri . } "
			},
			"answers": [{
				"head": {
					"vars": [
						"uri"
					]
				},
				"results": {
					"bindings": [{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Tom_Towles"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/William_Shatner"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Brenda_Bakke"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/John_Prosky"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Dan_Martin_(actor)"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Duane_Whitaker"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/J.T._Colosa"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Chuck_Williams_(actor)"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Dick_Van_Patten"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Dan_Gauthier"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Amy_Acker"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Rickey_Medlocke"
							}
						}
					]
				}
			}]
		},
		{
			"id": "62",
			"answertype": "resource",
			"aggregation": false,
			"onlydbo": true,
			"hybrid": false,
			"question": [{
					"language": "en",
					"string": "List all episodes of the first season of the HBO television series The Sopranos!",
					"keywords": "HBO, television series, Sopranos, first season, episode"
				},
				{
					"language": "pt_BR",
					"string": "Liste todos os episódios da primeira temporada do seriado Família Soprano da HBO.",
					"keywords": "episódio, primeira temporada, seriado, Família Soprano, HBO"
				},
				{
					"language": "de",
					"string": "Liste alle Episoden der ersten Staffel der HBO-Fernsehserie Die Sopranos auf.",
					"keywords": "HBO-Fernsehserie, Sopranos, erste Staffel, Episode"
				},
				{
					"language": "es",
					"string": "Dame todos los episodios de la prímera época de la serie de HBO Los Sporanos.",
					"keywords": "serie televisiva de HBO, Los Sopranos, primera época, episodios"
				},
				{
					"language": "it",
					"string": "Elenca tutti gli episodi della prima stagione della serie televisiva di HBO i Sopranos!",
					"keywords": "serie televisiva di HBO, i Sopranos, prima stagione, episodio"
				},
				{
					"language": "fr",
					"string": "Donnes-moi tous les épisodes de la première saison de la série télévisée de HBO les Sopranos.",
					"keywords": "épisodes de la première saison, HBO, les Sopranos"
				},
				{
					"language": "nl",
					"string": "Noem alle afleveringen van het eerste seizoen van de HBO-serie The Sopranos.",
					"keywords": "HBO-serie, The Sopranos, eerste seizoen, aflevering"
				},
				{
					"language": "hi_IN",
					"string": "एचबीओ टेलीविजन श्रृंखला द सोप्रानोस! के पहले सीज़न के सभी एपिसोड की सूची बनाएं ।",
					"keywords": "एचबीओ, टेलीविजन श्रृंखला, द सोप्रानोस!, पहले सीज़न, सभी एपिसोड"
				}
			],
			"query": {
				"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nSELECT DISTINCT ?uri \nWHERE {\n\t?uri dbo:series res:The_Sopranos  .\n        ?uri dbo:seasonNumber 1 .\n}"
			},
			"answers": [{
				"head": {
					"vars": [
						"uri"
					]
				},
				"results": {
					"bindings": [{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Isabella_(The_Sopranos)"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Meadowlands_(The_Sopranos)"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/The_Legend_of_Tennessee_Moltisanti"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/I_Dream_of_Jeannie_Cusamano"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Boca_(The_Sopranos)"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Nobody_Knows_Anything"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Pax_Soprana"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/A_Hit_Is_a_Hit"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Denial,_Anger,_Acceptance"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/College_(The_Sopranos)"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/46_Long"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/The_Sopranos_(episode)"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Down_Neck"
							}
						}
					]
				}
			}]
		},
		{
			"id": "67",
			"answertype": "list",
			"aggregation": false,
			"onlydbo": true,
			"hybrid": false,
			"question": [{
					"language": "en",
					"string": "Give me all launch pads operated by NASA.",
					"keywords": "launch pad, operate, NASA"
				},
				{
					"language": "pt_BR",
					"string": "Ache todas as plataformas de lançamento espaciais operadas pela NASA.",
					"keywords": "plataforma de lançamento, operadas, NASA"
				},
				{
					"language": "de",
					"string": "Gib mir alle von der NASA betriebenen Startrampen.",
					"keywords": "Startrampe, betreiben, NASA"
				},
				{
					"language": "es",
					"string": "Dame todas las plataformas de lanzamiento operadas por la NASA.",
					"keywords": "plataforma de lanzamiento, operada por la NASA"
				},
				{
					"language": "it",
					"string": "Dammi tutte le rampe di lancio gestite dalla NASA.",
					"keywords": "rampa di lancio, gestire, NASA"
				},
				{
					"language": "fr",
					"string": "Donnes-moi toutes les rampes de lancements des Etats-unis.",
					"keywords": "rampes de lancements, Etats-unis"
				},
				{
					"language": "nl",
					"string": "Noem alle lanceerplatformen van de NASA.",
					"keywords": "lanceerplatform, NASA"
				},
				{
					"language": "hi_IN",
					"string": "मुझे नासा द्वारा संचालित सभी लॉन्च पैड की सूचि दें।",
					"keywords": "नासा, संचालित, लॉन्च पैड"
				},
				{
					"language": "ro",
					"string": "Dă-mi toate rampele de lansare operate de către NASA.",
					"keywords": "rampă de lansare, operat, NASA"
				}
			],
			"query": {
				"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> \nPREFIX res: <http://dbpedia.org/resource/> \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> \nSELECT DISTINCT ?uri \nWHERE { \n        ?uri rdf:type dbo:LaunchPad .  \n        ?uri dbo:operator res:NASA . \n}"
			},
			"answers": [{
				"head": {
					"vars": [
						"list"
					]
				},
				"results": {
					"bindings": [{
							"list": {
								"type": "list",
								"value": "http://dbpedia.org/resource/Mid-Atlantic_Regional_Spaceport_Launch_Pad_0"
							}
						},
						{
							"list": {
								"type": "list",
								"value": "http://dbpedia.org/resource/Keweenaw_Rocket_Range"
							}
						},
						{
							"list": {
								"type": "list",
								"value": "http://dbpedia.org/resource/Spaceport_Florida_Launch_Complex_36"
							}
						},
						{
							"list": {
								"type": "list",
								"value": "http://dbpedia.org/resource/Wallops_Flight_Facility_Launch_Area_3"
							}
						},
						{
							"list": {
								"type": "list",
								"value": "http://dbpedia.org/resource/Broglio_Space_Centre"
							}
						},
						{
							"list": {
								"type": "list",
								"value": "http://dbpedia.org/resource/Kennedy_Space_Center_Launch_Complex_39"
							}
						},
						{
							"list": {
								"type": "list",
								"value": "http://dbpedia.org/resource/Cape_Canaveral_Air_Force_Station_Launch_Complex_13"
							}
						}
					]
				}
			}]
		},
		{
			"id": "78",
			"answertype": "resource",
			"aggregation": false,
			"onlydbo": true,
			"hybrid": false,
			"question": [{
					"language": "en",
					"string": "Give me all video games published by Mean Hamster Software.",
					"keywords": "video game, publish, Mean Hamster Software"
				},
				{
					"language": "pt_BR",
					"string": "Mostre todos os jogos da Mean Hamster Software.",
					"keywords": "Videospiel, Mean Hamster Software"
				},
				{
					"language": "de",
					"string": "Gib mir alle Videospiele von Mean Hamster Software.",
					"keywords": "Videospiel, Mean Hamster Software"
				},
				{
					"language": "es",
					"string": "Dame todos los videojuegos de Mean Hamster Software.",
					"keywords": "videojuego, Mean Hamster Software"
				},
				{
					"language": "it",
					"string": "Dammi tutti i videogiochi di Mean Hamster Software.",
					"keywords": "videogioco, prodotto, Mean Hamster Software"
				},
				{
					"language": "fr",
					"string": "Donnes-moi tous les jeux vidéos publiés par Mean Hamster Software.",
					"keywords": "jeux vidéos, publiés, Mean Hamster Software"
				},
				{
					"language": "nl",
					"string": "Geef me alle videogames van Mean Hamster Software.",
					"keywords": "videogame, Mean Hamster Software"
				},
				{
					"language": "hi_IN",
					"string": "मीन हम्सटर सॉफ्टवेयर द्वारा प्रकाशित सभी वीडियो गेम की सूचि दें। '",
					"keywords": "मीन हम्सटर सॉफ्टवेयर, प्रकाशित, वीडियो गेम"
				},
				{
					"language": "ro",
					"string": "Dă-mi toate jocurile video publicate de Mean Hamster Software",
					"keywords": "joc video, publicat, Mean Hamster Software"
				}
			],
			"query": {
				"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nSELECT DISTINCT ?uri \nWHERE {\n      ?uri rdf:type dbo:VideoGame .\n      ?uri dbo:publisher res:Mean_Hamster_Software . \n}"
			},
			"answers": [{
				"head": {
					"vars": [
						"uri"
					]
				},
				"results": {
					"bindings": [{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Crossbow_(video_game)"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Riven"
							}
						}
					]
				}
			}]
		},
		{
			"id": "88",
			"answertype": "resource",
			"aggregation": false,
			"onlydbo": true,
			"hybrid": false,
			"question": [{
					"language": "en",
					"string": "Give me the grandchildren of Elvis Presley.",
					"keywords": "Elvis Presley, grandchildren"
				},
				{
					"language": "pt_BR",
					"string": "Mostre os netos de Elvis Presley.",
					"keywords": "netos, Elvis Presley"
				},
				{
					"language": "fa",
					"string": "نوه های الویس پرسلی را لیست کن.",
					"keywords": "نوه های، الویس پرسلی"
				},
				{
					"language": "de",
					"string": "Gib mir die Enkel von Elvis Presley.",
					"keywords": "Elvis Presley, Enkel"
				},
				{
					"language": "es",
					"string": "Dame todos los nietos de Elvis Presley.",
					"keywords": "Elvis Presley, nietos"
				},
				{
					"language": "it",
					"string": "Dammi i nipoti di Elvis Presley.",
					"keywords": "Elvis Presley, nipoti"
				},
				{
					"language": "fr",
					"string": "Donne-moi tous les petit-enfants de Elvis Presley.",
					"keywords": "petit-enfants, Elvis Presley"
				},
				{
					"language": "nl",
					"string": "Toon alle kleinkinderen van Elvis Presley.",
					"keywords": "Elvis Presley, kleinkinderen"
				},
				{
					"language": "hi_IN",
					"string": "मुझे एल्विस प्रेस्ली के पोतों के नाम दे। ",
					"keywords": "एल्विस प्रेस्ली, पोतो के नाम"
				},
				{
					"language": "ro",
					"string": "Dă-mi nepoții lui Elvis Presley.",
					"keywords": "Elvis Presley, nepoți"
				}
			],
			"query": {
				"sparql": "SELECT DISTINCT ?uri WHERE { <http://dbpedia.org/resource/Elvis_Presley> <http://dbpedia.org/ontology/child> ?child . ?child <http://dbpedia.org/ontology/child> ?uri . }"
			},
			"answers": [{
				"head": {
					"vars": [
						"uri"
					]
				},
				"results": {
					"bindings": [{
						"uri": {
							"type": "uri",
							"value": "http://dbpedia.org/resource/Riley_Keough"
						}
					}]
				}
			}]
		},
		{
			"id": "95",
			"answertype": "resource",
			"aggregation": false,
			"onlydbo": true,
			"hybrid": false,
			"question": [{
					"language": "en",
					"string": "Give me all Canadian Grunge record labels.",
					"keywords": "record label, Canadian, Grunge"
				},
				{
					"language": "pt_BR",
					"string": "Liste todas as gravadoras canadenses de música Grunge.",
					"keywords": "gravadoras, canadenses, música, Grunge"
				},
				{
					"language": "de",
					"string": "Gib mir alle kanadischen Grunge-Plattenfirmen.",
					"keywords": "kanadisch, Plattenfirma, Grunge"
				},
				{
					"language": "es",
					"string": "Dame todos las empresas canadienses productoras de música Grunge.",
					"keywords": "empresa productora de música, canadiense, Grunge"
				},
				{
					"language": "it",
					"string": "Dammi tutti i produttori canadesi di musica Grunge.",
					"keywords": "produttore di musica, canadese, Grunge"
				},
				{
					"language": "fr",
					"string": "Donnes-moi tous les labels discographiques canadiens de grunge.",
					"keywords": "labels discographiques, canadiens, grunge"
				},
				{
					"language": "nl",
					"string": "Noem alle Canadese grunge-platenlabels.",
					"keywords": "Canadees, platenlabel, Grunge"
				},
				{
					"language": "hi_IN",
					"string": "मुझे सभी कैनेडियन ग्रांज रिकॉर्ड लेबल की सूचि दें।",
					"keywords": "कैनेडियन, ग्रांज, रिकॉर्ड लेबल"
				}
			],
			"query": {
				"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nSELECT DISTINCT ?uri \nWHERE {\n\t?uri rdf:type dbo:RecordLabel .\n        ?uri dbo:genre res:Grunge .\n        ?uri dbo:country res:Canada .\n}"
			},
			"answers": [{
				"head": {
					"vars": [
						"uri"
					]
				},
				"results": {
					"bindings": [{
						"uri": {
							"type": "uri",
							"value": "http://dbpedia.org/resource/Murderecords"
						}
					}]
				}
			}]
		},
		{
			"id": "143",
			"answertype": "resource",
			"aggregation": false,
			"onlydbo": true,
			"hybrid": false,
			"question": [{
					"language": "en",
					"string": "Show me the book that Muhammad Ali wrote.",
					"keywords": "book, wrote, Muhammad Ali"
				},
				{
					"language": "pt_BR",
					"string": "Mostre me o livro que Muhammad Ali escreveu.",
					"keywords": "livro, Muhammad Ali, escreveu"
				},
				{
					"language": "de",
					"string": "Zeig mir das Buch, das Muhammad Ali geschrieben hat.",
					"keywords": "Buch, geschrieben, Muhammad Ali"
				},
				{
					"language": "es",
					"string": "Muéstrame el libro escrito por Muhammad Ali.",
					"keywords": "libro, autor, Muhammad Ali"
				},
				{
					"language": "it",
					"string": "Mostrami il libro scritto da Muhammad Ali.",
					"keywords": "libro, autore, Muhammad Ali"
				},
				{
					"language": "fr",
					"string": "Donne-moi le livre écrit par Muhammad Ali.",
					"keywords": "livre, par Muhammad Ali"
				},
				{
					"language": "nl",
					"string": "Toen het boek dat Muhammad Ali heeft geschreven.",
					"keywords": "boek, geschreven, Muhammad Ali"
				},
				{
					"language": "hi_IN",
					"string": "मुझे किताब बताओ जो मुहम्मद अली ने लिखी थी।",
					"keywords": "किताब, मुहम्मद अली, लिखी"
				},
				{
					"language": "ro",
					"string": "Arată-mi cartea pe care a scris-o Muhammad Ali.",
					"keywords": "carte, scris, Muhammad Ali"
				}
			],
			"query": {
				"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/> \nPREFIX res: <http://dbpedia.org/resource/> \nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#> \nSELECT DISTINCT ?uri \nWHERE { \n         ?uri rdf:type dbo:Book . \n         ?uri dbo:author res:Muhammad_Ali . \n}"
			},
			"answers": [{
				"head": {
					"vars": [
						"uri"
					]
				},
				"results": {
					"bindings": [{
						"uri": {
							"type": "uri",
							"value": "http://dbpedia.org/resource/The_Soul_of_a_Butterfly"
						}
					}]
				}
			}]
		},
		{
			"id": "177",
			"answertype": "resource",
			"aggregation": false,
			"onlydbo": true,
			"hybrid": false,
			"question": [{
					"language": "en",
					"string": "Give me all Swedish oceanographers.",
					"keywords": "Swedish, oceanographer"
				},
				{
					"language": "pt_BR",
					"string": "Liste todos os oceanógrafos suecos.",
					"keywords": "oceanógrafos, suecos"
				},
				{
					"language": "de",
					"string": "Gib mir alle Schwedischen Ozeanographen.",
					"keywords": "Schwedisch, Ozeanographen"
				},
				{
					"language": "es",
					"string": "Dame todos los oceanógrafos suecos.",
					"keywords": "oceanógrafos suecos"
				},
				{
					"language": "it",
					"string": "Dammi tutti gli oceanografi svedesi.",
					"keywords": "svedesi, oceanografi"
				},
				{
					"language": "fr",
					"string": "Donne-moi tous les océanographes suédois.",
					"keywords": "Océanographes, suédois"
				},
				{
					"language": "nl",
					"string": "Toon alle Zweedse oceanograafen.",
					"keywords": "Zweedse, oceanograafen"
				},
				{
					"language": "hi_IN",
					"string": "मुझे सभी स्वीडिश महासागरीय वैज्ञानिकों की सूचि बतायें।",
					"keywords": "स्वीडिश, महासागरीय वैज्ञानिक"
				},
				{
					"language": "ro",
					"string": "Dă-mi toți oceanografii suedezi.",
					"keywords": "oceanograf, suedez"
				}
			],
			"query": {
				"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nSELECT DISTINCT ?uri\nWHERE {\n        ?uri dbo:field res:Oceanography . \n        ?uri dbo:birthPlace res:Sweden .        \n}"
			},
			"answers": [{
				"head": {
					"vars": [
						"uri"
					]
				},
				"results": {
					"bindings": [{
						"uri": {
							"type": "uri",
							"value": "http://dbpedia.org/resource/Vagn_Walfrid_Ekman"
						}
					}]
				}
			}]
		},
		{
			"id": "188",
			"answertype": "resource",
			"aggregation": true,
			"onlydbo": true,
			"hybrid": false,
			"question": [{
					"language": "en",
					"string": "Give me all books by William Goldman with more than 300 pages.",
					"keywords": "book, William Goldman, pages, more than 300"
				},
				{
					"language": "pt_BR",
					"string": "Liste todos os livros de William Goldman com mais de 300 páginas.",
					"keywords": "livro, William Goldman, mais de 300, páginas"
				},
				{
					"language": "de",
					"string": "Gib mir alle Bücher von William Goldman mit mehr als 300 Seiten.",
					"keywords": "Buch, William Goldman, Seiten, mehr als 300"
				},
				{
					"language": "es",
					"string": "Dame todos los libros de Wiliam Goldman con más de 300 páginas.",
					"keywords": "libro, William Goldman, más de 300 páginas"
				},
				{
					"language": "it",
					"string": "Dammi tutti i libri di Wiliam Goldman con più di 300 pagine.",
					"keywords": "libro, Wiliam Goldman, pagine, più di 300"
				},
				{
					"language": "fr",
					"string": "Donnes-moi tous les livres de William Goldman avec plus de 300 pages.",
					"keywords": "livres, William Goldman, plus de 300 pages"
				},
				{
					"language": "nl",
					"string": "Geef alle boeken van William Goldman met meer dan 300 pagina's.",
					"keywords": "boeken, William Goldman, meer dan 300 pagina's"
				},
				{
					"language": "hi_IN",
					"string": "मुझे ३०० से अधिक पृष्ठों के साथ विलियम गोल्डमैन की किताबें की सूचि बतायें।",
					"keywords": "३०० से अधिक पृष्ठों, विलियम गोल्डमैन, किताबें"
				},
				{
					"language": "ro",
					"string": "Dă-mi toate carțile de William Glodman cu mai mult de 300 de pagini.",
					"keywords": "carte, William Goldman, pagini, mai mult de 300"
				}
			],
			"query": {
				"sparql": "PREFIX dbo: <http://dbpedia.org/ontology/>\nPREFIX res: <http://dbpedia.org/resource/>\nPREFIX rdf: <http://www.w3.org/1999/02/22-rdf-syntax-ns#>\nSELECT DISTINCT ?uri \nWHERE {\n        ?uri rdf:type dbo:Book .\n        ?uri dbo:author res:William_Goldman .\n        ?uri dbo:numberOfPages ?x .\n        FILTER (?x > 300)\n}"
			},
			"answers": [{
				"head": {
					"vars": [
						"uri"
					]
				},
				"results": {
					"bindings": [{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Marathon_Man_(novel)"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Which_Lie_Did_I_Tell%3F"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Hype_and_Glory"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Tinsel_(novel)"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Boys_and_Girls_Together"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Control_(novel)"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/The_Color_of_Light"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/The_Princess_Bride"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Wait_Till_Next_Year"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Brothers_(Goldman_novel)"
							}
						}
					]
				}
			}]
		},
		{
			"id": "195",
			"answertype": "resource",
			"aggregation": false,
			"onlydbo": true,
			"hybrid": false,
			"question": [{
					"language": "en",
					"string": "Show me all books in Asimov's Foundation series.",
					"keywords": "books, Asimov, Foundation series"
				},
				{
					"language": "pt_BR",
					"string": "Mostre-me todos os livros de Asimov da série Fundação.",
					"keywords": "livros, Asimov, série Fundação"
				},
				{
					"language": "fa",
					"string": "مجموعه کتاب های آسیموف چند کتاب دارد؟",
					"keywords": "مجموعه کتاب های، آسیموف، کتاب"
				},
				{
					"language": "de",
					"string": "Zeig mir alle Bücher in Asimovs Foundation-Serie.",
					"keywords": "Asimov, Foundation-Serie, Bücher"
				},
				{
					"language": "es",
					"string": "Muéstrame todos los libros en la serie Fundación de Asimov",
					"keywords": "libros, serie Fundación Asimov"
				},
				{
					"language": "it",
					"string": "Mostrami tutti i libri del Ciclo della Fondazione di Asimov",
					"keywords": "libri, Ciclo della Fondazione, Asimov"
				},
				{
					"language": "fr",
					"string": "Montres-moi tous les livres du Cycle de Fondation d'Asimov.",
					"keywords": "livres, Cycle de Fondation, Asimov"
				},
				{
					"language": "nl",
					"string": "Toon alle boeken die bij de Foundation-serie horen.",
					"keywords": "boeken, Foundation-serie"
				},
				{
					"language": "hi_IN",
					"string": "असिमोव की फाउंडेशन श्रृंखला की सारी पुस्तकों की सूचि दिखाएं।",
					"keywords": "असिमोव, फाउंडेशन श्रृंखला, पुस्तकों"
				},
				{
					"language": "ro",
					"string": "Arată-mi toate cărțile din seria Fundația de Asimov",
					"keywords": "cărți, seria Fundația, Asimov"
				}
			],
			"query": {
				"sparql": "SELECT DISTINCT ?uri WHERE { ?uri <http://dbpedia.org/ontology/series> <http://dbpedia.org/resource/Foundation_series> . } "
			},
			"answers": [{
				"head": {
					"vars": [
						"uri"
					]
				},
				"results": {
					"bindings": [{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Foundation's_Edge"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Second_Foundation"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Foundation_(Isaac_Asimov_novel)"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Foundation_and_Chaos"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Foundation's_Triumph"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/The_Originist"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Prelude_to_Foundation"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Foundation's_Fear"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Foundation_and_Earth"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Forward_the_Foundation"
							}
						},
						{
							"uri": {
								"type": "uri",
								"value": "http://dbpedia.org/resource/Foundation_and_Empire"
							}
						}
					]
				}
			}]
		}
	]
}
